# Pandas1.

--> It is the most sought out packages for data science.

--> Pandas is used for data manipulation, analysis and cleaning.

--> !install pandas.

--> import pandas as pd.

Pandas deals with three data structures.

1)series.

2)dataframe.

3)panel.

# series.

--> Series is a one-dimensional array like structure with homogeneous data.

--> Creating Series.

A series can be created using various inputs like âˆ’

1) Array.

2) Dict.

3) Scalar value or constant

In [1]:
import pandas as pd
import numpy as np

In [2]:
# 1) Array.
#Without passing index
#numpy array
arr = np.array(['Reddy','Netzwerk','Banglore','Karnataka'])
print(arr)

['Reddy' 'Netzwerk' 'Banglore' 'Karnataka']

In [3]:
#creating the series using numpy array
s = pd.Series(arr)
print(s)

0        Reddy
1     Netzwerk
2     Banglore
3    Karnataka
dtype: object

In [4]:
#check the type
type(s)

pandas.core.series.Series

In [5]:
#by passing index.
#numpy array
arr = np.array(['Reddy','Netzwerk','Banglore','Karnataka'])

#creating series
s = pd.Series(arr,index=[100,101,102,103])
s

100        Reddy
101     Netzwerk
102     Banglore
103    Karnataka
dtype: object

In [6]:
# 2) series from Dictionary.

#here keys will be our default indexes
data = {'a' : 0, 'b' : 1, 'c' : 2}
s = pd.Series(data)
s

a    0
b    1
c    2
dtype: int64

# Dataframe.

--> A dataframe is a 2d, size-mutable, potentially heterogeneous tabular column data.

In [7]:
# creating empty dataframe.
# A basic DataFrame, which can be created is an Empty Dataframe.
import pandas as pd
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

-->Create a DataFrame from Dict of lists/ndArray.

->All the ndarrays must be of same length.

In [8]:
# Ex1) without index
name = ['CSK', 'RCB', 'MI', 'KKR']
age = [10,11,12,13]

# creating dictionary
data = {'Name':name,'Age':age}
print(data)
# passing dictionary to create df
df = pd.DataFrame(data)
df

{'Name': ['CSK', 'RCB', 'MI', 'KKR'], 'Age': [10, 11, 12, 13]}

  Name  Age
0  CSK   10
1  RCB   11
2   MI   12
3  KKR   13

In [9]:
# Ex2) with index
name = ['CSK', 'RCB', 'MI', 'KKR']
age = [10,11,12,13]

# my new indexes
indexes = ['rank1','rank2','rank3','rank4']

# creating dictionary
data = {'Name':name,'Age':age}
print(data)
# passing dictionary to create df
df = pd.DataFrame(data,index=indexes)
df

{'Name': ['CSK', 'RCB', 'MI', 'KKR'], 'Age': [10, 11, 12, 13]}

      Name  Age
rank1  CSK   10
rank2  RCB   11
rank3   MI   12
rank4  KKR   13

Column Selection

In [10]:
df['Name']

rank1    CSK
rank2    RCB
rank3     MI
rank4    KKR
Name: Name, dtype: object

Column Addition

In [11]:
# say suppose you want to add city column 
city = ['Chennai','Banglore','Mumbai','Kolkata']

#adding new column named 'City'
df["City"] = city
df

      Name  Age      City
rank1  CSK   10   Chennai
rank2  RCB   11  Banglore
rank3   MI   12    Mumbai
rank4  KKR   13   Kolkata

Column Deletion

In [12]:
# 1) Using del keyword
del df["Age"]

In [13]:
df

      Name      City
rank1  CSK   Chennai
rank2  RCB  Banglore
rank3   MI    Mumbai
rank4  KKR   Kolkata

In [ ]:
# we can use .pop() method also